{"Brews/Campaign-Frames/Brasslands":{"slug":"Brews/Campaign-Frames/Brasslands","filePath":"Brews/Campaign Frames/Brasslands.md","title":"Brasslands","links":["The-Rocketeer","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nAll aboard a wild adventure across the magical Brasslands! Travel the magical network of rails that can take you from the Western Reach all the way to the tip of the Crescent Coast. Confront the wild frontier of the terminal stations and discover what it’s like living life on a fast train.\nThe Foundation\nOverview\nMagical Rail has brought fast expansion across the realm. Towns turned into cities overnight, and realms that were once thought impossible to traverse now are connected by an ever growing system of rails. But rapid growth comes with its own challenges. Bandits attack trains that are traveling along the realm’s most vulnerable places, and an every expanding race to control the most track with the most advanced trains threatens to change life on the rails as we know it.\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesSteampunk and Decodence, Fast Paced, flow stateNomadic/frontier life, Questions of rapid magical and industrial growth, journey over destination\nTouchstones\n\n“The Rocketeer”\n“Wild Wild West”\n“Guns of Icarus”\n\nThe World\nImportant Places\nThe Train\nYour train will be the group’s home for most of the journey.\nUnion Tree\nThe center of the Brasslands. It is believed that all rails lead back to Union Tree.\nImportant People\nThe Creator\nPowerful wizard that was able to develop a means to making railway connections via magic.\nDistinctions\n\nWhat makes this world unique\n\nGood Trains Are Rare\nLaying track is as simple for some as thinking. However the ability to make a good transport has not matched the ability to lay rail.\nCharacter Guidance\n\nFor players to understand how to best interact with the world\n\nPlayer Principles\nBe Confident to Take Bold Action\nPlayers should be encouraged to take risks to make exciting play. This will be a high risk, high reward form of play. We can work together to define what the line of appropriate impact might be for failed rolls (removing character death for example)\nPlay Fast\nTied with the above principle, this Campaign Frame encourages quick decision making and trying to establish flow as much as possible.\nGM Principles\nKeep Things Moving\nI’ll encourage the group to not idle too long on a scene. Similarly NPCs will generally be geared towards moving on quickly\nSense of Time Passing While Discouraging FOMO\nThings will move on without the players. I’ll ail to provide what’s relevant without using FOMO as a means to regretting one’s actions. There will always be interesting opportunities.\nSession Zero\nBuild Train\nInciting Incident"},"Brews/Campaign-Frames/Happily-Ever-After":{"slug":"Brews/Campaign-Frames/Happily-Ever-After","filePath":"Brews/Campaign Frames/Happily Ever After.md","title":"Happily Ever After","links":["LINK","Kingdom-Hearts","Inception","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nVacation has become a whole lot more interesting when you find out that the lands in the Theme Park Capital of the world are not just built up stories, but windows into a magical realm.\nThe Foundation\nOverview\nThe theme parks are a veil holding in the real worlds of the movies. Below that is the “fabric” that is the tapestry of shared stories. Everyone is normal in the parks, but those who can access the “other side” find their true powers. For those who want a buffet of settings to play in, this is your portal.\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesGoofy and serious, “immersive”, chaos on vacation, blurring the lines between “natural” and fantastical worldsDissecting nostalgia, obsession, who writes the story?, family, magic has no morality, uncovering a hidden world beyond our own\nTouchstones\n\n“Kingdom Keepers”/“Kingdom Hearts”\n“Inception” - Players will take on the role of “Storyteller” for each “realm” they enter.\n“Vacationland” - When in “The Real World” players will still be in the regular Magic Kingdom. Being On Vacation is still a must.\n\nThe World\nImportant Places\nWalt Disney World\nThis campaign will primarily focus much of it’s action around Walt Disney World, the parks and surrounding infrastructure (hotels, transportation etc.)\nCharacter Guidance\n\nFor players to understand how to best interact with the word\n\nPlayer Principles\nPlayer Driven Worlds\nMany of the scenes within this campaign will have a high level of player input. In some cases players will have full control to describe the environment, people and other important details of the different stories they enter.\nGM Principles\nKeeping Continuity But Not Driving It\nAs established above players will have a wide latitude to create within this world. As a GM I will try and remind players of important creations or details in an effort to keep things cohesive\nCampaign Mechanics\nReal World/Magical World | in the regular world players do not have access to their magic or weapons. They do have access to any physical feats, experiences and proficiencies they may have or gain along the way. Anything that has a magical quality must either be performed in the magical realms or have some strenuous cost to try and materialize it in the real world.\nImagineer/Storyteller |This PC powers the world the group enters. One person is designated as the imagineer of the experience. They design the way in and way out of the world and the places you can interact with in there. Even some of the NPCs. They have great power to manipulate the space, but they will also be a great target of adversaries in the imaginary world.\nStorytellers will take 2 Stress at the start of every realm they create.\nSession Zero\nInciting Incident\nWe’ll discuss what brings all the characters together in the Magic Kingdom and what is the first trip into the imaginary realm."},"Brews/Campaign-Frames/Hollywood-Magic":{"slug":"Brews/Campaign-Frames/Hollywood-Magic","filePath":"Brews/Campaign Frames/Hollywood Magic.md","title":"Hollywood Magic","links":["Back-To-The-Future","Outlander","L.A.-Noire","La-La-Land","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nJourney to a time you’ve never experienced. In the 1950’s Hollywood is still a blooming industry that is discovering new ways to imbue magic into the movies… real magic. From like wizards and stuff.\nThe Foundation\nOverview\nImagine Back to the Future, but players travel to an alternate Southern California in 1950s with magic and fantasy creatures. The group gets lost in this fantasy Hollywood and has to find their way back.\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesNostalgic and romantic, sepia drenched, California cool by day noir by night, urban fantasy, time travel sci-fi, isekaiTrading technology for magic, fish out of water, magic of good storytelling\nTouchstones\n\n“Back To The Future”/“Outlander”\n“L.A. Noire”/“La La Land”\n“Hail Ceasar”\n\nThe World\nImportant Places\nMovie Theaters\nEach one has their own sort of magic to them.\nMovie Studios\nWe can discuss which studios would be fun to reimagine\n\nWarner Bros\nMGM\nWalt Disney Studios\n\nDistinctions\nHollywood… but with wizards and fantastical beings\nIt would be commonplace in this world to interact with wizards and other folks like Dragonborn, elves, and other fantasy cultures.\nCharacter Guidance\n\nFor players to understand how to best interact with the world\n\nPlayer Principles\nBring What You Want Into This New World\nSince this isn’t exactly the past, you can decide to bring in as much pop culture from the real world as you’d like. Maybe you might try and bring Star Wars 20 years early, or try and find this world’s Audrey Hepburn, or Alfred Hitchcock.\nSession Zero\nInciting Incident\nThe start of this campaign would begin in the modern day. As part of Session Zero we can discuss what transports the players to this alternate world."},"Brews/Campaign-Frames/Lux-Universalis":{"slug":"Brews/Campaign-Frames/Lux-Universalis","filePath":"Brews/Campaign Frames/Lux Universalis.md","title":"Lux Universalis","links":["Bauhaus","Gesamtkunstwerk","Wagner's-ideal-for-the-Ring-Cycle","Mobile-Suit-Gundam---The-Witch-From-Mercury","The-Magicians","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"DnD campaign idea where players are part of a school that’s loosely based on Bauhaus. In this case, Design would be replaced with magic(?). Commentary on the world would still be paramount to the fantasy aspect of the story.\nTeachers would try to teach “Good Design” in magic. One where use and purpose are considered thoughtfully. Additionally it would highlight collaboration (teamwork) and mechanically encourage creative solutions to Adventuring Problems.\nConflict would arise between two factions that think their use of Bauhaus teachings are “the right way”. Gesamtkunstwerk that is bad for society (see Wagner’s ideal for the Ring Cycle)\nThe Pitch\nIn the land where the great mountain meets the sea lies the greatest school in the world. Lux Universalis is open to any and all folk whose journey finds them on school grounds.\nThe Foundation\nOverview\nIn the high fantasy setting of Lux Universalis, players interact with the legendary school. They learn about the world and adventuring through classes and teachers at the school. Eventually they may find themselves on a journey that puts what they’ve learned to the true test!\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesLight Academia, High FantasyCreativity, Exploration, Intersectionality, Does Magic Need a Cost?\nTouchstones\n\n“Mobile Suit Gundam - The Witch From Mercury”\n“The Magicians”, but like not depressing\n\nImportant People\nThe Founding Faculty\nGroup of Professors that built and run the school\nDistinctions\nThe Journey To School is Difficult\nMany people turn away before they’re able to conquer the mountain or the sea to arrive at the school. While at the school, students often group themselves by how they arrived; by Mountain, by Sea, or by Fate (birth, some other way)\nMagic is Rare But Can Be Found\nMost people outside of school cannot perform magic. But LU has found a very high success rate in teaching its students how to find their magic.\nSession Zero\nBuild Map\nFor this Campaign Frame we would collectively how the university and surrounding town are designed.\nInciting Incident\nHow (and why) did you get to the school?\nThis can be kept secret between the other PCs if you’d like\nWhat is causing the group to get together"},"Brews/Campaign-Frames/Mysterious-Island-of-Magic":{"slug":"Brews/Campaign-Frames/Mysterious-Island-of-Magic","filePath":"Brews/Campaign Frames/Mysterious Island of Magic.md","title":"Mysterious Island of Magic","links":[],"tags":[],"content":"The Pitch\nBoat crashes on a mysterious island. Everyone starts to realize they have magic powers they did not have before. The longer they stay the stronger they all become.\nTheir past reveals secret connections, but why did they appear on the island together. And what is the purpose of the island\nThe Foundation\nOverview\nImportant Places\nImportant People\nPlayer Principles (Detailed)\nGM Principles (Detailed)\nCampaign Mechanics (Optional)\nDistinctions\n\nWhat makes this world unique\n\nCharacter Guidance\n\nFor players to understand how to best interact with the world\n\nBuild Map\nSession Zero\nInciting Incident"},"Brews/Campaign-Frames/Teenage-Guardian-Powered-People":{"slug":"Brews/Campaign-Frames/Teenage-Guardian-Powered-People","filePath":"Brews/Campaign Frames/Teenage Guardian Powered People.md","title":"Teenage Guardian Powered People","links":["Mighty-Morphin-Power-Rangers","Pretty-Guardian-Sailor-Moon","Buffy-The-Vampire-Slayer","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nA great evil has escaped and has set up base on the moon. Determined to take revenge on their captors, minions descend on the coastal town that holds the only magic that could contain this evil. But they may find that group of teenagers with attitude might prove to be too much for them.\nThe Foundation\nOverview\nThis Campaign Frame puts it’s\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesAfter School Serials, 90s nostalgia, so high schoolMagical Girl, Monster of the Week, great power great responsibility\nTouchstones\n\n“Mighty Morphin Power Rangers”/“Pretty Guardian Sailor Moon”/“Persona Series\n“Buffy The Vampire Slayer”\n\nThe World\nImportant Places\nCommunity Center\nSome place like a community center or arcade where students hang out after school\nHigh School\nImportant People\nPrincipal\nSome Guiding Figure\nThis would be like a Zordon or Luna that informs the teens about their magic powers and alerts them when something bad is happening.\nDistinctions\n\nWhat makes this world unique\n\nSecret Magical World\nWorld is very normal and 90s. However under the surface there is a set of magical people affecting the world.\nCharacter Guidance\n\nFor players to understand how to best interact with the world\n\nPlayer Principles\nSo High School\nAll players will be teens in high school. So role play like you’re a teen!\nDifferent Seats At The Cafeteria\nA common trope for these groups is that this bestowing of power puts people together who wouldn’t normally interact with one another. It would be cool to try and establish those differences at the onset and work towards building teamwork and camaraderie throughout the campaign.\nGM Principles\nEpisodic Storytelling\nI will aim to try and keep sessions as episodic as possible. Meaning we won’t try and cram too many things at once in a session. We’ll move quickly through things so that we can reach a satisfying conclusion to the problem of the session\nTeamwork Makes The Theme Work\nWhenever possible, it is encouraged to suggest moves that require mutliple PCs to work together on an action or objective. I will do my best to always encourage and facilitate such actions.\nCampaign Mechanics\nMagical Girl Transformation\nGenerally you’ll have access to most of your personal abilities. Special Powers and weapons will require you to transform. You cannot be seen to transform though! You have to find a place where no one can see you.\nSession Zero\nBuild Map\nWe’ll design the town the players reside in.\nInciting Incident"},"Brews/Campaign-Frames/The-Celestial-Sea":{"slug":"Brews/Campaign-Frames/The-Celestial-Sea","filePath":"Brews/Campaign Frames/The Celestial Sea.md","title":"The Celestial Sea","links":["Pirates-of-the-Caribbean","Our-Flag-Means-Death","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nIt’s Fantasy adventure in the open sea! Go back to a time where the world was still not fully discovered. Magic and swashbuckling rule the waters. Find your flag and show your true colors.\nThe Foundation\nOverview\nThe Celestial Sea is a High Seas High Fantasy adventure that will take players on a journey of worldly and self-discovery. To stay in the spirit of the touchstones, this campaign will be a very joyful and camp adventure.\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesHigh Seas Adventure, High Seas Fun!Call to Adventure, Unexpected pairings, Anachronism, Wideness of the World\nTouchstones\n\n“Pirates of the Caribbean”\n“Our Flag Means Death”\n\nCharacter Guidance\n\nFor players to understand how to best interact with the world\n\nPlayer Principles\nLean into Camp\nWe are unserious pirates! If you have a choice pick the most fun one\nInterpersonal Dynamics\nTry to roleplay friction across the crew (including with other PCs), but alway aim to resolve your differences by the end of the “episode”.\nGM Principles\nEstablish A Diverse World of People and Places\nAim to be Narratively Satifying\nWhile there may be high emotional drama the goal should always be to land on an emotionally satisfying conclusion  across an arc.\nCampaign Mechanics\nBoat stuff\nSession Zero\nBuild Map\nSecret to the players is that the sea is a very large pool surrounded by land in all but one semi large inlet to the Northwest. The sea is known to be so large that most people who try and map the space never return.\nInciting Incident\nHow might the crew have come together, this could be played out in the first session or we can pick up the start as a fully formed crew."},"Brews/Campaign-Frames/The-Kings’-Highway":{"slug":"Brews/Campaign-Frames/The-Kings’-Highway","filePath":"Brews/Campaign Frames/The Kings’ Highway.md","title":"The Kings’ Highway","links":["Mobile-Fighter-G-Gundam","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nThe banners are called, brooms are readied, and the road is set for the most exciting race of all time! It’s been a score and two more since the first Journey concluded and established peace across the realm. Since then, The Podium of Kings have decreed that every five years representatives from any house may compete for the opportunity to ascend the throne to rule the lands. The Journey across The Kings’ Highway is an opportunity not just for those who win. Great treasures await all who participate… and survive!\nThe Foundation\nOverview\nIn the Kings’ Highway, players are brought into a world where magic is powered by play and competition. The start of the campaign will be on the eve of the Grand Depart. While the most well funded houses seek to stand atop the podium, many still participate for the fame and accolades. Others participate for the chance to find very rare magical items that can only be formed when such a competition is held.\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesHigh fantasy racing action, fast brooms and slow living roomsContrasting Ideologies, teamwork, fish out of water, games are magic, sports are political\nTouchstones\n\n“The Adventure Zone - Balance”\n“Cars (2006)”\n“Mobile Fighter G Gundam”\n“Wacky Races”\n\nThe World\nImportant Places\nThe Kings’ Highway\nThe path taken across the realm\nThe Grand Depart\nCity off the coast where The Journey begins.\nImportant People\nThe Podium of Kings\nThree rulers all of different houses that oversee the realm.\nLegacy Houses\nThese are houses that have stood atop the podium at The Journey’s End.\nDistinctions\nGames are Magic\nMagic in this world is powered by play and competition. The most powerful and pure form of magic is known as Ludomancy.\nCharacter Guidance\n\nFor players to understand how to best interact with the world## Player Principles (Detailed)\n\nPlayer Principles\nFulfillment Beyond Winning\nWhile many racers look to be the first across the finish line, there is still merit towards racing even if you have no chance of winning. You will likely not be able to win every part of the race, but there will be many opportunities to explore personal goals other than winning.\nGM Princples\nEngage Everyone\nNot everyone has to be a Broom Flyer. There will be many opportunities for each player to be engaged in all parts of play.\nEncourage Teamwork\nEven though racers often race for themselves, it often takes a team for any one individual to be successful\nIt’s Not Just About Sports (I Promise!)\nCampaign Mechanics\nGames Are Magic\nmagic-based features may require some form of play or competition to become empowered. This may also mean that a feature may become refreshed mid-race, allowing you to use it more than once.\nTraining\nAs a rest action, take a stress during rest to ready some magic.\nSession Zero\nBuild Route"},"Brews/Campaign-Frames/The-Old-Gods-and-The-New":{"slug":"Brews/Campaign-Frames/The-Old-Gods-and-The-New","filePath":"Brews/Campaign Frames/The Old Gods and The New.md","title":"The Old Gods and The New","links":["The-Great-Gatsby","The-Rocketeer","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":[],"content":"The Pitch\nThe party never ends when the Pantheon of gods decide to come down to earth to party with the mortals. That is until they decide the party’s over. Interact with the mortal and immortal alike as you make it through the excess of the end of the world.\nThe Foundation\nOverview\n\n\n\n\n\n\n\n\n\n\n\n\n\nTone And FeelThemesParty like it’s 1929, Historical FantasyImmortality and morality, Religious and Political Upheaval, what do we owe to each other (whether mortal or immortal)\nTouchstones\n\n“The Great Gatsby”/“The Rocketeer”\n“The Wicked and The Divine”/“Hades”\n\nThe World\nImportant Places\nGold Coast Mansion\nOne where the main Pantheon meet and party\nImportant People\nThe Pantheon\nDistinctions\n\nWhat makes this world unique\n\nGods Among Us\nFor the most part the Gods act as mortals with immense wealth and power. To a chosen few they reveal themselves for one reason or another.\nSession Zero\nInciting Incident"},"Brews/Campaign-Ideas":{"slug":"Brews/Campaign-Ideas","filePath":"Brews/Campaign Ideas.md","title":"Campaign Ideas","links":["Brews/Campaign-Frames/Brasslands","Brews/Campaign-Frames/The-Celestial-Sea","Brews/Campaign-Frames/Happily-Ever-After","Brews/Campaign-Frames/Hollywood-Magic","Brews/Campaign-Frames/The-Kings’-Highway","Brews/Campaign-Frames/Lux-Universalis","Brews/Campaign-Frames/The-Old-Gods-and-The-New","Brews/Campaign-Frames/Teenage-Guardian-Powered-People"],"tags":["MapOfContent","Games/RolePlay","admin/exploreexclude"],"content":"These are some ideas I had for our upcoming Campaign. Feel free to suggest changes to better suit the desires of the group.\nCampaign Frames\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNameTaglineTone &amp; FeelBrasslandsLet’s Go Go Go On A Big World Adventure!Steampunk &amp; Art Decodence, Fast PacedThe Celestial SeaFind Your Flag And Show Your True ColorsHigh Seas Adventure, High Seas Fun!Happily Ever AfterDon’t just ride the movies — Be a part of themGoofy and serious, “immersive”, chaos on vacationHollywood MagicHave The Time Of Your Life — Worry About What Time Is It LaterNostalgic and romantic, sepia drenched, California cool by day noir by night, urban fantasy, time travel sci-fiThe Kings’ HighwaySee The Road To The EndHigh fantasy racing action, fast brooms and slow living roomsLux UniversalisMagic Follows MeaningLight Academia, High Fantasy Low UrgencyThe Old Gods and The NewParty Like It’s 1929It’s The End Of The World As We Know It And I Feel Fine, High Pantheon Low ClassTeenage Guardian Powered PeoplePower Up &amp; Save The World, All Before HomeroomAfter School Serials, 90s Nostalgia"},"Brews/Daggerheart-Campaign---2025/Daggerheart-Campaign---2025":{"slug":"Brews/Daggerheart-Campaign---2025/Daggerheart-Campaign---2025","filePath":"Brews/Daggerheart Campaign - 2025/Daggerheart Campaign - 2025.md","title":"In-Person Daggerheart Campaign","links":["Brews/Campaign-Ideas","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero"],"tags":["InProgress","PersonalProject"],"content":"This is the Homepage for Stefan’s In-Person Daggerheart Campaign (2025)1.\nPlayers can use this as a wiki for important details for the campaign.\nCampaign Ideas\nTransclude of Campaign-Ideas\nSessions\nSession Zero\nFootnotes\n\n\nThis title will be updated once a Campaign Frame is selected. ↩\n\n\n"},"Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero":{"slug":"Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero","filePath":"Brews/Daggerheart Campaign - 2025/Sessions/Session Zero.md","title":"Session Zero","links":["Brews/Campaign-Ideas","Daggerheart_Core_Rulebook-5-20-2025.pdf"],"tags":["Games/Daggerheart2025"],"content":"Select A Campaign Frame\nFirst thing we’ll do is select a Campaign Frame. This will help us set the overall setting for the campaign. What is described with each Campaign Frame idea is only a starting point and can be modified to suit the group’s ideal form of play.\nCATS\nThis is an acronym used in the Daggerheart Core Rulebook(pg. 169) to help make it clear how to establish what the campaign will be like as we play it.\nConcept\n\nWhat’s the big-picture pitch? If this campaign was a book series, how would you hype it up to a friend you know would love it?… [This is] a great way to set a guiding star for your creative discussion throughout Session Zero and Beyond.\nZxhm\nDaggerheart_Core_Rulebook-5-20-2025, page 170\n\nAim\nLogisitcs\nHow Often Do We Want To Try And Meet And For How Long Per Session?\nReflection Cadence or First Pass Check\nDeciding when to check in to see if we still like playing the campaign, if we want to change how often or where we meet.\nSocial Goals\nWhat’s The Level of Play That We Want To Engage In?\n\nEx. Mostly RolePlay, Mostly Combat, deep note taking or less complicated engagement\n\nAny Specific Social Goals That We Want To Achieve?\n\nEx. Have a cozy mystery, defeat a big bad, mostly beach episodes\n\nTone\nSubject\n\nDiscuss subjects you and the players actively want in the game and topics you want to avoid. Subjects to avoid can be broad themes, such as bigotry and torture, or specific elements, such as spiders or a particular name that carries emotional weight for a player.\n\nDaggerheart_Core_Rulebook-5-20-2025, page 171\nLines And Veils\nX-Card\nRead more about these tools on the Daggerheart Website\nCharacter Creation\nCharacter Experiences\nRelationships With Other PCs\nPlayer Tools\nDaggerheart Character Builder | Digital Character Sheet App\nObsidian TTRPG Tutorials | Guide towards using Obsidian to note take for your RPGs\nObsidian TTRPG Tutorials - Daggerheart | Specific resources around Daggerheart\nBuild A Map\nWe can discuss how in depth as a group we’d like to be with the map making process."},"Brews/MCH-Projects":{"slug":"Brews/MCH-Projects","filePath":"Brews/MCH Projects.md","title":"Percolating Projects","links":["Brews/Campaign-Ideas"],"tags":["InProgress"],"content":"Games\n\nMountain Project\nThe Genius School\nHollywoodland Megagame\nThe World Turned Upside Down - 1st Amendment\n\nWorld of Ludomancy\n\nThe OWL League - Season 2\nBroom Racing Game\n\nOther Things\n\nCampaign Ideas\nEndless Summer Camp\n"},"Concepts/Digital-Garden---Terrace":{"slug":"Concepts/Digital-Garden---Terrace","filePath":"Concepts/Digital Garden - Terrace.md","title":"What is A Digital Garden","links":["Concepts/How-This-Garden-is-Set-Up"],"tags":[],"content":"The idea of sharing some aspect (possibly all) of one’s linked notes. Specifically sharing like a blog but non-chronologically.\n\nLinks For Further Discovery\nA Brief History &amp; Ethos of the Digital Garden\nHow This Garden is Set Up"},"Concepts/How-This-Garden-is-Set-Up":{"slug":"Concepts/How-This-Garden-is-Set-Up","filePath":"Concepts/How This Garden is Set Up.md","title":"How This Garden Is Set Up","links":[],"tags":["meta"],"content":"The Terrace is stood up using Quartz as its static site generator."},"Thoughts/Challenges-with-Publishing-Process":{"slug":"Thoughts/Challenges-with-Publishing-Process","filePath":"Thoughts/Challenges with Publishing Process.md","title":"Challenges with Publishing Process","links":["Thoughts/Publishing-Process"],"tags":[],"content":"As defined in Publishing Process I’m accepting some level of friction in favor of privacy and some level of curation. Here are some challenges ive identified with this process\nContent Management\nNote Name vs Public Title\nSometimes there is a collision with the name of a general note and an article or idea I want to write for The Terrace. This means i may need to adjust article headline to align more with the public facing title. The follow on issue is that i have trouble remembering how to link portions of The Terrace together because their title names do not conform with how I’ve been linking notes in my main vault. Linking is the most beneficial aspect of this form of collected writing. So in this way I am also working harder to present meaningful links to the reader and may forget to make a useful association here.\nDifferences Between Vaults\nI just took 20 minutes looking for a file that simply might not exist in my main vault. This is probably highlighting that i have to be more explicit about keeping a 1:1 mapping of content as much as possible."},"Thoughts/Journey-Through-Note-Taking":{"slug":"Thoughts/Journey-Through-Note-Taking","filePath":"Thoughts/Journey Through Note Taking.md","title":"Journey Through Note Taking","links":["Concepts/Digital-Garden---Terrace","Thoughts/Publishing-Process"],"tags":["InProgress"],"content":"Physical Note taking\nLoose Notes\nHashtag BuJo\nPocket Experiments\nDigital Note taking\n🤷\nYou’ve Got The Notion\nNow Obsidian is My Best Friend\n\nObsidian leads also to this digital garden being formed. Find out more out more about my Publishing Process and some of the challenges that come with it."},"Thoughts/Publishing-Process":{"slug":"Thoughts/Publishing-Process","filePath":"Thoughts/Publishing Process.md","title":"Publishing Process","links":["Concepts/How-This-Garden-is-Set-Up","Thoughts/Challenges-with-Publishing-Process"],"tags":["process","meta"],"content":"Based on Quartz documentation, all content for the site needs to reside in the content folder of the site. Since The Terrace acts as a public portion of my overall Obsidian vault, I go through a process of taking authored content and migrating it over to be published\n\nWrite authored content in personal vault\nStore content in folder called Terrace\nCopy contents of Terrace over to content folder.\nOpen folder in Obsidian and fix/remove links that do not work in this vault.\nPublish\n\n\nI think this generally goes against common convention. However I find I’m conflicted between having a unified, single vault that stores very private items and having some portion of that also be available for public viewing.\nWritten Public Content vs General Notes\nAnother challenge I have is that my personal vault is written much more atomically than anything written for public consumption. Atomic notes allow for a much more connectivity between ideas generating various forms of context stemming from a single notion.\nPublic consumption makes that harder to convey without presenting the entire vault to the public. Additionally, writing with a public facing lens in mind is a helpful practice that allows for meaning to be more easily shared.\nSo in general, I guess i accept that there will be some friction in this process to ensure some level of privacy and the ability to curate content to some degree."},"Thoughts/The-First-Choice-Is-What-To-Play":{"slug":"Thoughts/The-First-Choice-Is-What-To-Play","filePath":"Thoughts/The First Choice Is What To Play.md","title":"The First Choice Is What To Play","links":["Campaign-Frame","Brews/Daggerheart-Campaign---2025/Sessions/Session-Zero","Brews/Campaign-Ideas"],"tags":[],"content":"Lately I’ve been wanting to start a proper campaign with friends again, but it’s become increasingly challenging to get people bought in to want to keep a consistent game going until the end. Simultaneously, I was seeing some interesting ideas coming out of the release of Daggerheart. This system, coming from the creators of Critical Role, emphasizes an interesting mix of detail-oriented game mechanics, and complex player choice and input typically only seen in indie games. This focus on player choice made me consider ”how could I get buy-in for a campaign from the start?”\nCampaign Frames\n\nI stumbled on this video from Ginny Di that laid clear a simply way to pitch a campaign to a group of players. As someone who loves creating worlds, Campaign Frames sounded like the perfect template to quickly establish what makes a specific world so compelling. I think even before starting a Session Zero this concept of a pitching a number of different ideas seemed appealing to me.\nCampaign Frames offer the first place for players to collaborate with the GM in a structured way to curate the experience we all have. GMs and players can have discussions about different touchstones to add or remove, and it even makes it clear up front to the players the kind of tone and feel that should be shared between GM and player.\n\nI’ve shared a few quick ideas for Campaigns here."},"Thoughts/Why-Make-A-Digital-Garden":{"slug":"Thoughts/Why-Make-A-Digital-Garden","filePath":"Thoughts/Why Make A Digital Garden.md","title":"Why Make a Digital Garden","links":["Digital-Garden","Thoughts/Journey-Through-Note-Taking","MCH-Projects","Concepts/Digital-Garden---Terrace"],"tags":[],"content":"I love the non-conventional way a Digital Garden allows people to explore a site with curiosity rather than via an algorithm. Ideas can be made important or relevant not by how complete the concept is, but rather by the reader’s interest in the moment.\nMaking a Digital Garden for Magic Coffeehouse will allow me to share ideas that are still forming and get feedback from people who are interested in seeing more from a specific concept. Simultaneously, I hope it encourages others to generate their own ideas and take them further than I could alone.\nYour Own Personal Wikipedia\nEventually I may describe on here my journey through note taking, but the most relevant aspect to the question above is my use of  [Obsidian](FIX LINK). I have been taking notes in Obsidian for over a year and it has felt like a revelation to my note taking habit. It’s allowed me to rediscover ideas and notes through the fun of hoping through links like you’re on Wikipedia. Paired with Digital Gardening, it now seems like there is a clear path to having an outlet for some of these ideas that could blossom into newer thoughts or projects.\n[INSERT GRAPH PHOTO]\n\nTransclude of Digital-Garden---Terrace"},"index":{"slug":"index","filePath":"index.md","title":"The Terrace at Magic Coffeehouse","links":["Thoughts/Why-Make-A-Digital-Garden","MCH-Projects","Thoughts"],"tags":[],"content":"\nThrough the back door of the Magic Coffeehouse lies a terrace full of conversations, growing plants, and perfectly brewed coffee.\n\nWelcome to the back patio for Magic Coffeehouse! Instead of hosting a traditional blog, I wanted to start a Digital Garden that could be used to present ideas in various states of completeness.\nEntry Points\nFrom here you could\n\nExplore Projects being developed.\nDiscover Ideas being shared in public.\nSomething else not yet written.\n"}}